Revit 2027 API
DimensionSegment.Value Property
 The length of the segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double? Value { get; }
Public ReadOnly Property Value As Double?
	Get
public:
property Nullable<double> Value {
	Nullable<double> get ();
}
member Value : Nullable<float> with get
Property Value
Nullable<Double>
See Also
Reference
DimensionSegment Class
Autodesk.Revit.DB Namespace